{
  "navbar_home": "Главная",
  "navbar_about": "Обо мне",
  "navbar_projects": "Проекты",
  "navbar_resume": "Резюме",
  "home_hi_there": "Привет!",
  "home_im": "Я - ",
  "home_name": "Алексей",
  "home_introduce_myself": "Позвольте мне представиться",
  "home_about_description": "В мире DevOps я стремлюсь к высокому профессионализму и успешно решаю задачи в разнообразных технических средах. Моя экспертиза включает использование Docker и Kubernetes для разработки надежных решений, а также умелое использование Jenkins для автоматизации и оптимизации процессов системы. Я сосредоточен на создании и оптимизации масштабируемых облачных решений на платформах, таких как GCP и AWS, для достижения максимальной эффективности. Придерживаясь принципов Agile, я стремлюсь улучшать процессы управления проектами и содействовать непрерывному инновационному развитию в инфраструктуре системы.",
  "home_find_me_on": "НАЙДИТЕ МЕНЯ НА",
  "home_connect_with_me": "Не стесняйтесь связаться со мной",
  "type_certified_professional": "Сертифицированный профессионал по облачной DevOps-инженерии",
  "type_linux_system_admin": "Администратор Linux-систем",
  "type_dreamy_devops": "Мечтательный DevOps-инженер",
  "type_atlassian_administrator": "Администратор Atlassian",
  "type_computer_system_engineer": "Инженер компьютерных систем",
  "type_newbie_web_developer": "Новичок веб-разработчик",
  "type_ethnical_hacker": "Получил сертификат Ethical hacker от Cisco",
  "about_title": "Узнайте, кто я",
  "professional_skillset": "Профессиональные навыки",
  "tools_i_use": "Используемые инструменты",
  "about_card_intro": "Привет всем, я ",
  "about_card_from": "из ",
  "about_card_currently_looking": "Развиваясь в области DevOps и Site Reliability Engineering, я шаг за шагом продвигаюсь к своей мечте.",
  "about_card_certification": "Успешно выполнил все требования для получения статуса Сертифицированного профессионала по облачной DevOps-инженерии от Google Cloud.",
  "about_card_activities_intro": "Помимо самообразования, я также люблю заниматься другими активностями!",
  "about_card_activity_sport": "Занятия спортом",
  "about_card_activity_tv": "Просмотр телешоу",
  "about_card_activity_reading": "Чтение книг",
  "about_card_quote": "\"DevOpsDive: Инжиниринг завтрашних решений сегодня\"",
  "bages_and_certificates": "Бейджи и Сертификаты",
  "click_to_verify": "нажми для верификации",
  "github_days_i_code": "Дни, когда я пишу",
  "github_code": "Код",
  "github_web_hobby": "Веб - мое хобби",
  "projects_my_recent_works": "Мои последние работы",
  "projects_description": "Вот несколько проектов, над которыми я работал недавно.",
  "project_jira_title": "Разворачивание и автоматизация Jira",
  "project_jira_description": "Развернул Jira для управления проектами, настроил ее с помощью автоматических скриптов для отслеживания задач, планирования спринтов и рабочих процессов команды, тем самым повысив производительность и соответствуя методам Agile.",
  "project_docker_compose_title": "Инфраструктура с использованием Docker-compose",
  "project_docker_compose_description": "Создал инфраструктуру с использованием Docker-compose, соединив сайт WordPress с базой данных MySQL. Настроил сервер WordPress на порту 8080 и настроил MySQL для эффективного взаимодействия с сайтом.",
  "project_proxmox_title": "Виртуальный центр данных Proxmox",
  "project_proxmox_description": "Развернул виртуальный центр данных на основе Proxmox, управляя виртуальными машинами и обеспечивая высокую надежность с регулярными резервными копиями. Эта настройка гарантирует производительность и безопасность для всех служб.",
  "project_nginx_title": "Настройка Nginx",
  "project_nginx_description": "Настроил Nginx для подключения домена и SSL, улучшая безопасность и эффективность веб-сервиса. Подстроил серверные блоки для улучшения производительности, установил SSL для шифрованной передачи данных.",
  "project_jenkins_title": "Внедрение Jenkins",
  "project_jenkins_description": "Настроил Jenkins для автоматизированных рабочих процессов и непрерывной интеграции, настроив конвейеры и интегрировав их с системами управления версиями. Это увеличило эффективность, скорость и последовательность разработки.",
  "project_phbt_title": "CRM-система для Pharmbiotest",
  "project_phbt_description": "Разработал специализированную CRM-систему для Pharmbiotest, улучшив отслеживание обслуживания, управление базой данных клиентов и программы лояльности. Оптимизировал для улучшения взаимодействия с клиентами и оптимизации доставки услуг с использованием передовых инструментов баз данных.",
  "project_landing_title": "Адаптивная лендинг-страница",
  "project_landing_description": "Создал адаптивную лендинг-страницу с использованием HTML и CSS, с акцентом на адаптивном дизайне. Применил продвинутый CSS для гибкости на разных устройствах, обеспечивая бесперебойное взаимодействие с пользователем.",
  "project_multipage_title": "Интернет-магазин Foxtar",
  "project_multipage_description": "Разработал интернет-магазин Foxtar, обширную онлайн-платформу с дружелюбным дизайном. Внедрил функции электронной коммерции, такие как списки продуктов и корзина для полного опыта покупок.",
  "project_calculator_title": "Калькулятор на Vue.js",
  "project_calculator_description": "Создал интерактивный калькулятор с использованием Vue.js, с функциями отмены и повтора действий. Этот проект демонстрирует возможности Vue.js в области реактивности и управления состоянием.",
  "project_chess_title": "Шахматы в React",
  "project_chess_description": "Разработал двухигровую шахматную игру с использованием React, интегрировав классические правила в динамичный интерфейс. Эффективно управлял состоянием игры для улучшенной стратегической игры.",
  "project_fakestore_title": "Приложение Fake Store",
  "project_fakestore_description": "Разработал приложение на React, имитирующее опыт электронной коммерции с использованием FakeStoreAPI. Возможности включают просмотр продуктов, добавление их в корзину и взаимодействие с API.",
  "project_searchapp_title": "Приложение для поиска репозиториев GitHub",
  "project_searchapp_description": "Создал веб-приложение для поиска репозиториев на GitHub, позволяющее пользователям искать, просматривать детали и сохранять избранные репозитории. Использует API GitHub для получения данных в реальном времени.",
  "download_cv": "Скачать резюме",
  "select_en_resume": "Резюме на английском языке",
  "select_ua_resume": "Резюме на украинском языке",
  "footer_copywright_1": "Инжиниринг решений завтрашнего дня, сегодня",
  "footer_copywright_2": "Авторские права © {{year}} DevOpsDive"
}
