{
  "navbar_home": "Головна",
  "navbar_about": "Про мене",
  "navbar_projects": "Проекти",
  "navbar_resume": "Резюме",
  "home_hi_there": "Привіт!",
  "home_im": "Моє ім'я",
  "home_name": "Олексій Кошеленко",
  "home_introduce_myself": "ДОЗВОЛЬТЕ МЕНІ",
  "home_introduce": "ПРЕДСТАВИТИСЯ",
  "home_about_description1": "У світі DevOps я прагну до високого професіоналізму та успішно вирішую завдання в різноманітних технічних середовищах.",
  "home_about_description2": "Моя експертиза включає використання Docker та Kubernetes для розробки надійних рішень, і я вміло використовую Jenkins для автоматизації та оптимізації системних процесів.",
  "home_about_description3": "Я зосереджений на створенні та оптимізації масштабованих хмарних рішень на платформах, таких як GCP та AWS, для досягнення максимальної ефективності.",
  "home_about_description4": "Дотримуючись принципів, я прагну покращувати процеси управління проектами та сприяти неперервному інноваційному розвитку інфраструктури системи.",
  "home_find_me_on": "ЗНАЙДІТЬ МЕНЕ НА",
  "home_connect_with_me": "Не соромтеся зв'язатися зі мною",
  "type_certified_professional": "Сертифікований професіонал з облачної DevOps-інженерії",
  "type_linux_system_admin": "Адміністратор Linux-систем",
  "type_dreamy_devops": "Мрійливий DevOps-інженер",
  "type_atlassian_administrator": "Адміністратор Atlassian",
  "type_computer_system_engineer": "Інженер комп'ютерних систем",
  "type_newbie_web_developer": "Новачок веб-розробник",
  "about_title": "Дізнайтеся, хто я",
  "professional_skillset": "Професійні навички",
  "tools_i_use": "Інструменти, які я використовую",
  "about_card_intro": "Привіт усім, мене звати",
  "about_card_from": "я родом з ",
  "about_card_country": "України",
  "about_card_currently_looking": "На даний момент шукаю роботу мрії.",
  "about_card_certification": "Я отримав статус Сертифікованого професіонала з облачної DevOps-інженерії від Google Cloud",
  "about_card_activities_intro": "Крім самоосвіти, я також залучаюся до різних інших активностей!",
  "about_card_activity_sport": "Спорт",
  "about_card_activity_tv": "Перегляд телешоу",
  "about_card_activity_reading": "Читання книг",
  "about_card_quote": "\"DevOpsDive: Інженерія рішень завтрашнього дня, вже сьогодні!\"",
  "github_days_i_code": "Дні, коли я трошки пишу",
  "github_code": "код",
  "github_web_hobby": "Веб - моє хобі",
  "projects_my_recent_works": "Мої останні роботи",
  "projects_description": "Ось декілька проектів, якими я займався останнім часом.",
  "project_jira_title": "Розгортання та автоматизація Jira",
  "project_jira_description": "Розгорнув Jira для управління проектами, налаштував її за допомогою автоматичних скриптів для відстеження завдань, планування спринтів та робочих процесів команди, тим самим підвищивши продуктивність та відповідність методам Agile.",
  "project_docker_compose_title": "Інфраструктура з використанням Docker-compose",
  "project_docker_compose_description": "Створив інфраструктуру з використанням Docker-compose, з'єднавши сайт WordPress з базою даних MySQL. Налаштував сервер WordPress на порту 8080 і налаштував MySQL для ефективної взаємодії з сайтом.",
  "project_proxmox_title": "Віртуальний центр даних Proxmox",
  "project_proxmox_description": "Розгорнув віртуальний центр даних на основі Proxmox, керуючи віртуальними машинами та забезпечуючи високу надійність з регулярними резервними копіями. Ця настройка гарантує продуктивність і безпеку для всіх служб.",
  "project_nginx_title": "Налаштування Nginx",
  "project_nginx_description": "Налаштував Nginx для підключення домену та SSL, підвищивши безпеку та ефективність веб-сервісу. Підстроїв серверні блоки для покращення продуктивності, встановив SSL для шифрування передачі даних.",
  "project_jenkins_title": "Впровадження Jenkins",
  "project_jenkins_description": "Налаштував Jenkins для автоматизованих робочих процесів та неперервної інтеграції, налаштувавши конвеєри та інтегрувавши їх з системами управління версіями. Це підвищило ефективність, швидкість та послідовність розробки.",
  "project_phbt_title": "CRM-система для Pharmbiotest",
  "project_phbt_description": "Розробив спеціалізовану CRM-систему для Pharmbiotest, покращивши відстеження обслуговування, керування базою даних клієнтів та програми лояльності. Оптимізував для поліпшення взаємодії з клієнтами та оптимізації доставки послуг за допомогою передових інструментів баз даних.",
  "project_landing_title": "Адаптивна лендінг-сторінка",
  "project_landing_description": "Створив адаптивну лендінг-сторінку з використанням HTML та CSS, з акцентом на адаптивному дизайні. Застосував передовий CSS для гнучкості на різних пристроях, забезпечуючи безперебійну взаємодію з користувачем.",
  "project_multipage_title": "Інтернет-магазин Foxtar",
  "project_multipage_description": "Розробив інтернет-магазин Foxtar, обширну онлайн-платформу з дружнім дизайном. Впровадив функції електронної комерції, такі як списки продуктів та кошик для повного досвіду покупок.",
  "project_calculator_title": "Калькулятор за допомогою Vue.js",
  "project_calculator_description": "Створив інтерактивний калькулятор за допомогою Vue.js з можливістю скасування та повтору дій. Цей проект демонструє можливості Vue.js у сфері реактивності та управління станом.",
  "project_chess_title": "Шахи за допомогою React",
  "project_chess_description": "Розробив двохгравцеву шахову гру за допомогою React, інтегруючи класичні правила в динамічний інтерфейс. Ефективно керував станом гри для покращеної стратегічної гри.",
  "project_fakestore_title": "Додаток Fake Store",
  "project_fakestore_description": "Розробив додаток на React, що імітує досвід електронної комерції за допомогою FakeStoreAPI. Можливості включають перегляд товарів, їх додавання до кошика та взаємодію з API.",
  "project_searchapp_title": "Додаток для пошуку репозиторіїв GitHub",
  "project_searchapp_description": "Створив веб-додаток для пошуку репозиторіїв на GitHub, що дозволяє користувачам шукати, переглядати деталі та зберігати улюблені репозиторії. Використовує API GitHub для отримання даних у реальному часі.",
  "download_cv": "Завантажити резюме",
  "select_en_resume": "Англійська версія резюме",
  "select_ua_resume": "Українська версія резюме",
  "footer_copywright_1": "Інженерія рішень завтрашнього дня, вже сьогодні!",
  "footer_copywright_2": "Авторські права © {{year}} DevOpsDive"
}
