{
  "navbar_home": "Home",
  "navbar_about": "About",
  "navbar_projects": "Projects",
  "navbar_resume": "Resume",
  "home_hi_there": "Hi There!",
  "home_im": "I'M",
  "home_name": "Alex",
  "home_introduce_myself": "LET ME ",
  "home_introduce": "INTRODUCE MYSELF",
  "home_about_description1": "As a DevOps engineer, I specialize in designing scalable solutions and optimizing technical processes across complex infrastructural environments.",
  "home_about_description2": "My expertise encompasses building highly available solutions using Docker and Kubernetes, while implementing efficient automated workflows through Jenkins and modern CI/CD practices.",
  "home_about_description3": "I excel in architecting and optimizing cloud solutions across GCP, Azure, and AWS, achieving maximum performance with optimal resource utilization.",
  "home_about_description4": "Following Agile principles, I drive continuous innovation in project management and infrastructure development, ensuring constant process improvement.",
  "home_find_me_on": "CONNECT WITH ME",
  "home_connect_with_me": "Let's collaborate on innovative solutions",
  "type_certified_professional": "Multi-cloud Systems Engineer",
  "type_linux_system_admin": "Google Cloud Professional DevOps Engineer",
  "type_dreamy_devops": "Certified in Amazon Web Services",
  "type_atlassian_administrator": "Certified in Microsoft Azure",
  "type_computer_system_engineer": "Top 1000 Worldwide in Google Skill Boost Challenge (2024)",
  "type_newbie_web_developer": "Driven by complex challenges, I innovate and deliver impactful DevOps solutions that transform business operations.",
  "type_ethnical_hacker": "Certified Ethical Hacker with expertise in cybersecurity fundamentals and advanced security practices, committed to continuous growth in security and infrastructure protection",
  "about_title": "My Professional Journey",
  "professional_skillset": "Professional Skillset",
  "tools_i_use": "Tools I use",
  "about_card_intro": "Hi Everyone, I am ",
  "about_card_from": "IT Engineer from ",
  "about_card_country": "Ukraine",
  "about_card_currently_looking": "Advancing in Systems Engineering, DevOps, and Site Reliability Engineering, I continuously expand my technical horizons and expertise.",
  "about_card_certification": "Certified as a Google Cloud Professional DevOps Engineer, AWS Cloud Practitioner, and Microsoft Azure Administrator, demonstrating comprehensive cloud expertise.",
  "about_card_activities_intro": "Apart from self-learning, some other activities that I love to do!",
  "about_card_activity_sport": "Sport activities",
  "about_card_activity_tv": "Watching TV shows",
  "about_card_activity_reading": "Reading books",
  "about_card_quote": "\"DevOpsDive: Engineering Tomorrow's Solutions, Today\" ",
  "bages_and_certificates": "Bages and Certificates",
  "click_to_verify": "click to verify",
  "github_days_i_code": "Days I",
  "github_code": "Code",
  "github_web_hobby": "Web its my hobby",
  "projects_my_recent_works": "Featured Projects",
  "projects_description": "Here are a few projects I've worked on recently.",
  "project_jira_title": "Jira Deployment and Automation",
  "project_jira_description": "Deployed Jira for project management, customizing it with automated scripts for task tracking, sprint planning, and team workflows, thus boosting productivity and aligning with agile methods.",
  "project_docker_compose_title": "Docker-compose Infrastructure",
  "project_docker_compose_description": "Created an infrastructure using Docker-compose, connecting a WordPress site with a MySQL database. Configured the WordPress server on port 8080 and set up MySQL for effective site interaction.",
  "project_proxmox_title": "Proxmox Virtual Data Center",
  "project_proxmox_description": "Deployed a Proxmox-based virtual data center, managing virtual machines and ensuring high reliability with regular backups. This setup guarantees performance and security for all services.",
  "project_nginx_title": "Nginx Configuration",
  "project_nginx_description": "Configured Nginx for domain connection and SSL, enhancing web service security and efficiency. Adjusted server blocks for improved performance, installing SSL for encrypted data transfer.",
  "project_jenkins_title": "Jenkins Implementation",
  "project_jenkins_description": "Set up Jenkins for automated workflows and CI, customizing pipelines and integrating with version control systems. This enhanced development efficiency, speed, and consistency.",
  "project_phbt_title": "Pharmbiotest CRM",
  "project_phbt_description": "Developed a specialized CRM system for Pharmbiotest, enhancing service tracking, client database management, and loyalty programs. Optimized for improved client engagement and streamlined service delivery with advanced database tools.",
  "project_landing_title": "Responsive Landing Page",
  "project_landing_description": "Crafted an adaptive landing page using HTML and CSS, focusing on responsive design. Employed advanced CSS for flexibility across devices, ensuring a seamless user experience.",
  "project_multipage_title": "Foxtar Online Store",
  "project_multipage_description": "Developed the Foxtar Store, a comprehensive online retail platform with user-friendly design. Incorporated e-commerce features like product listings and shopping cart for a complete shopping experience.",
  "project_calculator_title": "Vue.js Calculator",
  "project_calculator_description": "Built an interactive calculator using Vue.js, featuring undo and redo functions. This project showcases Vue.js's capabilities in reactivity and state management.",
  "project_chess_title": "React-based Chess Game",
  "project_chess_description": "Developed a two-player chess game with React, integrating classic rules into a dynamic interface. Efficiently managed game state for enhanced strategic gameplay.",
  "project_fakestore_title": "Fake Store Application",
  "project_fakestore_description": "Developed a React application simulating an e-commerce experience with FakeStoreAPI. Features include browsing products, adding to cart, and understanding API integration.",
  "project_searchapp_title": "GitHub Repository Search App",
  "project_searchapp_description": "Designed a web app for searching GitHub repositories, enabling users to search, view details, and save favorite repositories. Utilizes GitHub's API for real-time data retrieval.",
  "download_cv": "Download CV",
  "select_en_resume": "English CV",
  "select_ua_resume": "Ukrainian CV",
  "footer_copywright_1": "Engineering Tomorrow's Solutions, Today",
  "footer_copywright_2": "Copyright © {{year}} DevOpsDive",
  "all": "All",
  "type_project": "Project",
  "type_task": "Task",
  "category_cloud": "Cloud Services",
  "category_cicd": "CI/CD & Containers",
  "category_monitoring": "Monitoring & Logging",
  "category_iac": "Infrastructure as Code",
  "category_security": "Security",
  "category_automation": "Automation",
  "category_infrastructure": "Infrastructure",
  "active_filters": "Active filters",
  "clear_all": "Clear all",
  "showing_results": "Showing {{count}} results",
  "no_results": "No projects found",
  "try_different_filters": "Try different filters",
  "reset_all_filters": "Reset all filters",
  "task_kubernetes_title": "Kubernetes Deployment",
  "task_kubernetes_description": "Set up Kubernetes cluster and deployed microservices with auto-scaling and monitoring.",
  "task_aws_title": "AWS Infrastructure Setup",
  "task_aws_description": "Implemented AWS infrastructure using Terraform, including VPC, EC2, and RDS setups.",
  "task_elk_title": "ELK Stack Implementation",
  "task_elk_description": "Implemented ELK stack for centralized logging and monitoring of applications.",
  "task_cloud_migration_title": "Cloud Migration Project",
  "task_cloud_migration_description": "Migrated on-premise applications to cloud platform using Infrastructure as Code.",
  "project_azure_infrastructure_title": "Enterprise Azure Infrastructure",
  "project_azure_infrastructure_description": "Led development of Azure infrastructure with CI/CD implementation, resulting in 70% faster deployments. Implemented secure networking, automated deployments with GitHub Actions and Terraform for microservices architecture. Integrated comprehensive monitoring solutions.",
  

  "project_aws_lambda_title": "AWS Lambda Migration & Security",
  "project_aws_lambda_description": "Successfully migrated 50+ AWS Lambda functions to Python 3.11. Developed and implemented test scenarios for security challenge assessment, strengthening weak points. Provided technical expertise during AWS Weeks 2024 events.",
  
  "project_terraform_infrastructure_title": "IT Marathon Infrastructure",
  "project_terraform_infrastructure_description": "Architected core Terraform infrastructure as primary developer. Designed secure network architecture including Virtual Networks, Security Groups, and Private DNS. Presented infrastructure automation solutions to 500+ students at EPAM tech conference.",

  "project_monitoring_solution_title": "Enterprise Monitoring System",
  "project_monitoring_solution_description": "Implemented comprehensive monitoring solutions using Grafana and Zabbix, reducing incident response time by 60%. Managed infrastructure serving 100+ users with 99.9% system uptime. Integrated alerting and automated response systems.",
  
  "project_infrastructure_automation_title": "Infrastructure Automation Project",
  "project_infrastructure_automation_description": "Implemented infrastructure automation reducing deployment time by 50%. Managed cloud and on-premise infrastructure with 99.9% uptime. Automated workflows increasing team productivity by 40%. Technologies: Ansible, Docker, Jenkins, Proxmox.",

  "project_crm_system_title": "Healthcare CRM System",
  "project_crm_system_description": "Developed specialized CRM system for pharmaceutical company, decreasing processing time by 40%. Implemented automation features and integrated with existing systems. Built with modern stack including React and Firebase.",
  
  "task_git_optimization_title": "Git Repository Optimization",
  "task_git_optimization_description": "Optimized Git repository structure and workflows, significantly reducing storage costs. Implemented GitLab-Bitbucket mirroring for cross-team collaboration.",
  
  "task_backup_solution_title": "Cloud Backup Solution",
  "task_backup_solution_description": "Developed backup solution for Commercetools data using Azure Logic Apps. Implemented automated backup verification and recovery testing procedures.",
  
  "task_kubernetes_setup_title": "Kubernetes Infrastructure Setup",
  "task_kubernetes_setup_description": "Optimized Kubernetes ingress whitelisting and cluster configuration. Implemented microservices architecture with automated scaling and monitoring.",

  "project_bosch_cicd_title": "Enterprise E-Commerce CI/CD Pipeline",
  "project_bosch_cicd_description": "Architected and implemented comprehensive CI/CD pipeline for Bosch's e-commerce platform using Jenkins and Azure DevOps. Integrated with Commercetools, implemented automated testing, and established deployment strategies for microservices architecture. Achieved 70% faster deployment times and 99.9% deployment success rate.",

  "project_gcp_kubernetes_title": "GCP Kubernetes Infrastructure",
  "project_gcp_kubernetes_description": "Designed and implemented production-grade Kubernetes infrastructure on Google Cloud Platform. Set up GKE clusters with autoscaling, implemented pod security policies, and configured Cloud Load Balancing. Integrated with Cloud Monitoring and Cloud Logging for comprehensive observability.",

  "project_multicloud_security_title": "Multi-Cloud Security Framework",
  "project_multicloud_security_description": "Developed comprehensive security framework across GCP, AWS, and Azure. Implemented IAM policies, security groups, and network policies. Created automated security compliance checks and remediation procedures. Achieved zero security incidents post-implementation.",

  "project_terraform_automation_title": "Infrastructure as Code Platform",
  "project_terraform_automation_description": "Built enterprise-grade Infrastructure as Code platform using Terraform for multi-cloud deployments. Implemented modular design for reusable components, automated state management, and integrated with CI/CD pipelines. Reduced infrastructure deployment time by 80%.",

  "project_monitoring_platform_title": "Enterprise Monitoring Solution",
  "project_monitoring_platform_description": "Implemented comprehensive monitoring platform using Grafana, Prometheus, and custom exporters. Set up alerting, dashboards, and automated incident response. Reduced MTTR by 60% and improved system availability to 99.99%.",

  "task_lambda_migration_title": "AWS Lambda Python Migration",
  "task_lambda_migration_description": "Successfully migrated 50+ AWS Lambda functions from Python 3.8 to 3.11. Implemented automated testing framework and deployment pipeline, ensuring zero downtime during migration.",

  "task_terraform_azure_title": "Azure Infrastructure Automation",
  "task_terraform_azure_description": "Automated Azure infrastructure deployment using Terraform, including Virtual Networks, Private DNS, and Security Groups. Implemented modular design pattern for reusable components.",

  "task_microservices_deployment_title": "Microservices Platform Setup",
  "task_microservices_deployment_description": "Implemented microservices architecture using MACH principles (Microservices, API-first, Cloud-native, Headless). Set up service mesh, configured API gateway, and implemented automated scaling policies.",

    "project_commercetools_backup_title": "Commercetools Data Backup Solution",
    "project_commercetools_backup_description": "Developed automated backup solution for Commercetools platform using Azure Logic Apps. Implemented scheduled backups of critical business data, validation checks, and automated recovery procedures. Achieved 99.99% backup success rate and reduced data recovery time by 75%.",
  
    "project_git_optimization_title": "Git Infrastructure Optimization",
    "project_git_optimization_description": "Optimized Git repository structure and implemented efficient branching strategies, reducing storage costs and improving CI/CD performance. Set up GitLab-Bitbucket mirroring for cross-team collaboration. Achieved 40% reduction in repository size and 50% faster build times.",
  
    "project_mach_deployment_title": "MACH Composer Automation Platform",
    "project_mach_deployment_description": "Implemented automated microservices deployment using MACH Composer and GitHub Actions. Created reusable workflows for Commercetools services deployment, configured environment-specific deployments, and implemented automated testing. Reduced deployment time by 65% and eliminated manual configuration errors.",
  
    "task_backup_monitoring_title": "Backup Monitoring System",
    "task_backup_monitoring_description": "Developed comprehensive monitoring system for backup processes using Azure Monitor and Logic Apps. Implemented automated alerts and recovery procedures for failed backups.",
  
    "task_git_workflow_title": "Git Workflow Automation",
    "task_git_workflow_description": "Created automated Git workflows for branch management, code review, and deployment processes. Implemented pre-commit hooks and automated quality checks.",
  
    "task_mach_testing_title": "MACH Integration Testing",
    "task_mach_testing_description": "Developed automated testing framework for MACH-based microservices. Implemented integration tests and performance monitoring for API endpoints.",

    "project_git_mirror_title": "Cross-Platform Git Synchronization Solution",
  "project_git_mirror_description": "Implemented robust synchronization system between BitBucket and GitLab repositories, enabling seamless collaboration between multiple development teams with different platform preferences. Solved access management challenges through automated mirroring, ensuring real-time code synchronization while maintaining security policies. Resulted in 100% code consistency across platforms and eliminated access management overhead.",

  "task_mirror_monitoring_title": "Repository Sync Monitoring",
  "task_mirror_monitoring_description": "Developed monitoring system for repository synchronization status with automated alerts and recovery procedures for sync failures. Implemented metrics collection for sync performance and drift detection."

}