{
  "navbar_home": "Home",
  "navbar_about": "About",
  "navbar_projects": "Projects",
  "navbar_resume": "Resume",
  "home_hi_there": "Hi There!",
  "home_im": "I'M",
  "home_name": "Alex Koshelenko",
  "home_introduce_myself": "LET ME ",
  "home_introduce": "INTRODUCE MYSELF",
  "home_about_description1": "In the world of DevOps, I strive for a high level of professionalism, effectively tackling challenges across diverse technical environments.",
  "home_about_description2": "My expertise includes leveraging Docker and Kubernetes for developing robust solutions, and I skillfully use Jenkins for automating and streamlining system processes.",
  "home_about_description3": "I'm focused on crafting and optimizing scalable cloud solutions on platforms like GCP and AWS to achieve peak efficiency.",
  "home_about_description4": "Committed to Agile principles, I aim to enhance project management processes and foster continuous innovation in system infrastructure.",
  "home_find_me_on": "FIND ME ON",
  "home_connect_with_me": "Feel free to connect with me",
  "type_certified_professional": "Certified Professional Cloud DevOps Engineer",
  "type_linux_system_admin": "Linux system administrator",
  "type_dreamy_devops": "Dreamy DevOps Engineer",
  "type_atlassian_administrator": "Atlassian administrator",
  "type_computer_system_engineer": "Computer system Engineer",
  "type_newbie_web_developer": "Sometimes Web developer",
  "type_ethnical_hacker": "I have an Ethical Hacker certificate from Cisco",
  "about_title": "Know Who I'M",
  "professional_skillset": "Professional Skillset",
  "tools_i_use": "Tools I Use",
  "about_card_intro": "Hi Everyone, I am ",
  "about_card_from": "from ",
  "about_card_country": "Ukraine",
  "about_card_currently_looking": "I am currently looking for a Dream job.",
  "about_card_certification": "I successfully completed all the requirements to be recognized as a Google Cloud Certified Professional Cloud DevOps Engineer.",
  "about_card_activities_intro": "Apart from self-learning, some other activities that I love to do!",
  "about_card_activity_sport": "Sport activities",
  "about_card_activity_tv": "Watching TV shows",
  "about_card_activity_reading": "Reading books",
  "about_card_quote": "\"DevOpsDive: Engineering Tomorrow's Solutions, Today\" ",
  "github_days_i_code": "Days I",
  "github_code": "Code",
  "github_web_hobby": "Web its my hobby",
  "projects_my_recent_works": "My Recent Works",
  "projects_description": "Here are a few projects I've worked on recently.",
  "project_jira_title": "Jira Deployment and Automation",
  "project_jira_description": "Deployed Jira for project management, customizing it with automated scripts for task tracking, sprint planning, and team workflows, thus boosting productivity and aligning with agile methods.",
  "project_docker_compose_title": "Docker-compose Infrastructure",
  "project_docker_compose_description": "Created an infrastructure using Docker-compose, connecting a WordPress site with a MySQL database. Configured the WordPress server on port 8080 and set up MySQL for effective site interaction.",
  "project_proxmox_title": "Proxmox Virtual Data Center",
  "project_proxmox_description": "Deployed a Proxmox-based virtual data center, managing virtual machines and ensuring high reliability with regular backups. This setup guarantees performance and security for all services.",
  "project_nginx_title": "Nginx Configuration",
  "project_nginx_description": "Configured Nginx for domain connection and SSL, enhancing web service security and efficiency. Adjusted server blocks for improved performance, installing SSL for encrypted data transfer.",
  "project_jenkins_title": "Jenkins Implementation",
  "project_jenkins_description": "Set up Jenkins for automated workflows and CI, customizing pipelines and integrating with version control systems. This enhanced development efficiency, speed, and consistency.",
  "project_phbt_title": "Pharmbiotest CRM",
  "project_phbt_description": "Developed a specialized CRM system for Pharmbiotest, enhancing service tracking, client database management, and loyalty programs. Optimized for improved client engagement and streamlined service delivery with advanced database tools.",
  "project_landing_title": "Responsive Landing Page",
  "project_landing_description": "Crafted an adaptive landing page using HTML and CSS, focusing on responsive design. Employed advanced CSS for flexibility across devices, ensuring a seamless user experience.",
  "project_multipage_title": "Foxtar Online Store",
  "project_multipage_description": "Developed the Foxtar Store, a comprehensive online retail platform with user-friendly design. Incorporated e-commerce features like product listings and shopping cart for a complete shopping experience.",
  "project_calculator_title": "Vue.js Calculator",
  "project_calculator_description": "Built an interactive calculator using Vue.js, featuring undo and redo functions. This project showcases Vue.js's capabilities in reactivity and state management.",
  "project_chess_title": "React-based Chess Game",
  "project_chess_description": "Developed a two-player chess game with React, integrating classic rules into a dynamic interface. Efficiently managed game state for enhanced strategic gameplay.",
  "project_fakestore_title": "Fake Store Application",
  "project_fakestore_description": "Developed a React application simulating an e-commerce experience with FakeStoreAPI. Features include browsing products, adding to cart, and understanding API integration.",
  "project_searchapp_title": "GitHub Repository Search App",
  "project_searchapp_description": "Designed a web app for searching GitHub repositories, enabling users to search, view details, and save favorite repositories. Utilizes GitHub's API for real-time data retrieval.",
  "download_cv": "Download CV",
  "select_en_resume": "English CV",
  "select_ua_resume": "Ukrainian CV",
  "footer_copywright_1": "Engineering Tomorrow's Solutions, Today",
  "footer_copywright_2": "Copyright © {{year}} DevOpsDive"

}
